In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

%matplotlib inline

In [2]:
female_sole_pro = pd.read_csv('../data/Share_of_female_sole_proprietors.csv', engine='python')
female_sole_pro.shape

(365, 4)

In [3]:
female_sole_pro

         Country         Income group  Year Share of female sole proprietors
0    Afghanistan           Low income  2014                            0.70%
1    Afghanistan           Low income  2015                            0.80%
2    Afghanistan           Low income  2016                            0.70%
3    Afghanistan           Low income  2017                            1.70%
4    Afghanistan           Low income  2018                            2.80%
..           ...                  ...   ...                              ...
360       Zambia  Lower middle income  2014                           22.20%
361       Zambia  Lower middle income  2015                           24.70%
362       Zambia  Lower middle income  2016                           25.10%
363       Zambia  Lower middle income  2017                           24.80%
364       Zambia  Lower middle income  2018                           24.70%

[365 rows x 4 columns]

In [4]:
female_sole_pro.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 4 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Country                           365 non-null    object
 1   Income group                      365 non-null    object
 2   Year                              365 non-null    int64
 3   Share of female sole proprietors  249 non-null    object
dtypes: int64(1), object(3)
memory usage: 11.5+ KB

In [5]:
female_sole_pro.isnull().sum()

Country                               0
Income group                          0
Year                                  0
Share of female sole proprietors    116
dtype: int64

In [6]:
female_sole_pro_drop = female_sole_pro.dropna()

In [7]:
female_sole_pro_drop

         Country         Income group  Year Share of female sole proprietors
0    Afghanistan           Low income  2014                            0.70%
1    Afghanistan           Low income  2015                            0.80%
2    Afghanistan           Low income  2016                            0.70%
3    Afghanistan           Low income  2017                            1.70%
4    Afghanistan           Low income  2018                            2.80%
..           ...                  ...   ...                              ...
360       Zambia  Lower middle income  2014                           22.20%
361       Zambia  Lower middle income  2015                           24.70%
362       Zambia  Lower middle income  2016                           25.10%
363       Zambia  Lower middle income  2017                           24.80%
364       Zambia  Lower middle income  2018                           24.70%

[249 rows x 4 columns]

In [8]:
female_sole_pro_renamed = female_sole_pro_drop.rename(columns = {'Income group':'Income_group', 'Share of female sole proprietors':'Share_of_female_sole_proprietors' })

In [9]:
female_sole_pro_renamed

         Country         Income_group  Year Share_of_female_sole_proprietors
0    Afghanistan           Low income  2014                            0.70%
1    Afghanistan           Low income  2015                            0.80%
2    Afghanistan           Low income  2016                            0.70%
3    Afghanistan           Low income  2017                            1.70%
4    Afghanistan           Low income  2018                            2.80%
..           ...                  ...   ...                              ...
360       Zambia  Lower middle income  2014                           22.20%
361       Zambia  Lower middle income  2015                           24.70%
362       Zambia  Lower middle income  2016                           25.10%
363       Zambia  Lower middle income  2017                           24.80%
364       Zambia  Lower middle income  2018                           24.70%

[249 rows x 4 columns]

In [10]:
female_sole_pro_renamed.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 249 entries, 0 to 364
Data columns (total 4 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Country                           249 non-null    object
 1   Income_group                      249 non-null    object
 2   Year                              249 non-null    int64
 3   Share_of_female_sole_proprietors  249 non-null    object
dtypes: int64(1), object(3)
memory usage: 9.7+ KB

In [11]:
female_sole_pro_renamed['Share_of_female_sole_proprietors'] = female_sole_pro_renamed['Share_of_female_sole_proprietors'].str.replace('%', '')

In [12]:
female_sole_pro_renamed

         Country         Income_group  Year Share_of_female_sole_proprietors
0    Afghanistan           Low income  2014                             0.70
1    Afghanistan           Low income  2015                             0.80
2    Afghanistan           Low income  2016                             0.70
3    Afghanistan           Low income  2017                             1.70
4    Afghanistan           Low income  2018                             2.80
..           ...                  ...   ...                              ...
360       Zambia  Lower middle income  2014                            22.20
361       Zambia  Lower middle income  2015                            24.70
362       Zambia  Lower middle income  2016                            25.10
363       Zambia  Lower middle income  2017                            24.80
364       Zambia  Lower middle income  2018                            24.70

[249 rows x 4 columns]

In [13]:
female_sole_pro_renamed.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 249 entries, 0 to 364
Data columns (total 4 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Country                           249 non-null    object
 1   Income_group                      249 non-null    object
 2   Year                              249 non-null    int64
 3   Share_of_female_sole_proprietors  249 non-null    object
dtypes: int64(1), object(3)
memory usage: 9.7+ KB

In [14]:
female_sole_pro_renamed['Share_of_female_sole_proprietors'] = female_sole_pro_renamed['Share_of_female_sole_proprietors'].astype(float)

In [15]:
female_sole_pro_renamed.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 249 entries, 0 to 364
Data columns (total 4 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Country                           249 non-null    object
 1   Income_group                      249 non-null    object
 2   Year                              249 non-null    int64
 3   Share_of_female_sole_proprietors  249 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 9.7+ KB

In [16]:
female_sole_pro_renamed

         Country         Income_group  Year  Share_of_female_sole_proprietors
0    Afghanistan           Low income  2014                               0.7
1    Afghanistan           Low income  2015                               0.8
2    Afghanistan           Low income  2016                               0.7
3    Afghanistan           Low income  2017                               1.7
4    Afghanistan           Low income  2018                               2.8
..           ...                  ...   ...                               ...
360       Zambia  Lower middle income  2014                              22.2
361       Zambia  Lower middle income  2015                              24.7
362       Zambia  Lower middle income  2016                              25.1
363       Zambia  Lower middle income  2017                              24.8
364       Zambia  Lower middle income  2018                              24.7

[249 rows x 4 columns]

In [17]:
female_sole_pro_renamed.Income_group.value_counts()

High income            89
Upper middle income    80
Low income             44
Lower middle income    36
Name: Income_group, dtype: int64

In [18]:
High_income = female_sole_pro_renamed.query('Income_group == "High income"')
High_income.head()

    Country Income_group  Year  Share_of_female_sole_proprietors
15  Austria  High income  2014                              57.3
16  Austria  High income  2015                              58.3
17  Austria  High income  2016                              60.0
18  Austria  High income  2017                              58.5
19  Austria  High income  2018                              58.3

In [19]:
Low_income = female_sole_pro_renamed.query('Income_group == "Low income"')
Low_income.head()

       Country Income_group  Year  Share_of_female_sole_proprietors
0  Afghanistan   Low income  2014                               0.7
1  Afghanistan   Low income  2015                               0.8
2  Afghanistan   Low income  2016                               0.7
3  Afghanistan   Low income  2017                               1.7
4  Afghanistan   Low income  2018                               2.8

In [20]:
Lower_middle_income = female_sole_pro_renamed.query('Income_group == "Lower middle income"')
Lower_middle_income.head()

          Country         Income_group  Year  Share_of_female_sole_proprietors
65  Cote d'Ivoire  Lower middle income  2014                              26.9
66  Cote d'Ivoire  Lower middle income  2015                              26.8
67  Cote d'Ivoire  Lower middle income  2016                              27.8
68  Cote d'Ivoire  Lower middle income  2017                              24.5
69  Cote d'Ivoire  Lower middle income  2018                              25.9

In [21]:
Upper_middle_income = female_sole_pro_renamed.query('Income_group == "Upper middle income"')
Upper_middle_income.head()

   Country         Income_group  Year  Share_of_female_sole_proprietors
5  Albania  Upper middle income  2014                              36.1
6  Albania  Upper middle income  2015                              36.0
7  Albania  Upper middle income  2016                              31.9
8  Albania  Upper middle income  2017                              32.1
9  Albania  Upper middle income  2018                              31.1

In [22]:
High_income_average = (High_income.groupby(['Income_group'], as_index=False)['Share_of_female_sole_proprietors'].mean())
High_income_average

  Income_group  Share_of_female_sole_proprietors
0  High income                         35.907865

In [23]:
Low_income_average = (Low_income.groupby(['Income_group'], as_index=False)['Share_of_female_sole_proprietors'].mean())
Low_income_average

  Income_group  Share_of_female_sole_proprietors
0   Low income                         24.477273

In [24]:
Lower_middle_income_average = (Lower_middle_income.groupby(['Income_group'], as_index=False)['Share_of_female_sole_proprietors'].mean())
Lower_middle_income_average

          Income_group  Share_of_female_sole_proprietors
0  Lower middle income                         29.772222

In [25]:
Upper_middle_income_average = (Upper_middle_income.groupby(['Income_group'], as_index=False)['Share_of_female_sole_proprietors'].mean())
Upper_middle_income_average

          Income_group  Share_of_female_sole_proprietors
0  Upper middle income                          31.90875

In [26]:
High_income['difference_to_average_share'] = High_income['Share_of_female_sole_proprietors'] - High_income_average['Share_of_female_sole_proprietors'].values[0]

<ipython-input-26-42c224d353be>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  High_income['difference_to_average_share'] = High_income['Share_of_female_sole_proprietors'] - High_income_average['Share_of_female_sole_proprietors'].values[0]

In [27]:
High_income.head()

,Country,Income_group,Year,Share_of_female_sole_proprietors,difference_to_average_share
15,Austria,High income,2014,57.3,21.392135
16,Austria,High income,2015,58.3,22.392135
17,Austria,High income,2016,60.0,24.092135
18,Austria,High income,2017,58.5,22.592135
19,Austria,High income,2018,58.3,22.392135

In [28]:
Low_income['difference_to_average_share'] = Low_income['Share_of_female_sole_proprietors'] - Low_income_average['Share_of_female_sole_proprietors'].values[0]

<ipython-input-28-2090e3ab29a0>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Low_income['difference_to_average_share'] = Low_income['Share_of_female_sole_proprietors'] - Low_income_average['Share_of_female_sole_proprietors'].values[0]

In [29]:
Low_income.head()

,Country,Income_group,Year,Share_of_female_sole_proprietors,difference_to_average_share
0,Afghanistan,Low income,2014,0.7,-23.777273
1,Afghanistan,Low income,2015,0.8,-23.677273
2,Afghanistan,Low income,2016,0.7,-23.777273
3,Afghanistan,Low income,2017,1.7,-22.777273
4,Afghanistan,Low income,2018,2.8,-21.677273

In [30]:
Lower_middle_income['difference_to_average_share'] = Lower_middle_income['Share_of_female_sole_proprietors'] - Lower_middle_income_average['Share_of_female_sole_proprietors'].values[0]

<ipython-input-30-1ac20221f67d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Lower_middle_income['difference_to_average_share'] = Lower_middle_income['Share_of_female_sole_proprietors'] - Lower_middle_income_average['Share_of_female_sole_proprietors'].values[0]

In [31]:
Lower_middle_income.head()

,Country,Income_group,Year,Share_of_female_sole_proprietors,difference_to_average_share
65,Cote d'Ivoire,Lower middle income,2014,26.9,-2.872222
66,Cote d'Ivoire,Lower middle income,2015,26.8,-2.972222
67,Cote d'Ivoire,Lower middle income,2016,27.8,-1.972222
68,Cote d'Ivoire,Lower middle income,2017,24.5,-5.272222
69,Cote d'Ivoire,Lower middle income,2018,25.9,-3.872222

In [32]:
Upper_middle_income['difference_to_average_share'] = Upper_middle_income['Share_of_female_sole_proprietors'] - Upper_middle_income_average['Share_of_female_sole_proprietors'].values[0]

<ipython-input-32-3d8ce5528711>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Upper_middle_income['difference_to_average_share'] = Upper_middle_income['Share_of_female_sole_proprietors'] - Upper_middle_income_average['Share_of_female_sole_proprietors'].values[0]

In [33]:
Upper_middle_income.head()

,Country,Income_group,Year,Share_of_female_sole_proprietors,difference_to_average_share
5,Albania,Upper middle income,2014,36.1,4.19125
6,Albania,Upper middle income,2015,36.0,4.09125
7,Albania,Upper middle income,2016,31.9,-0.00875
8,Albania,Upper middle income,2017,32.1,0.19125
9,Albania,Upper middle income,2018,31.1,-0.80875

In [34]:
Upper_middle_income.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 80 entries, 5 to 349
Data columns (total 5 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   Country                           80 non-null     object
 1   Income_group                      80 non-null     object
 2   Year                              80 non-null     int64
 3   Share_of_female_sole_proprietors  80 non-null     float64
 4   difference_to_average_share       80 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 3.8+ KB

In [35]:
concat_data = pd.concat([High_income, Low_income, Lower_middle_income, Upper_middle_income])
concat_data

,Country,Income_group,Year,Share_of_female_sole_proprietors,difference_to_average_share
15,Austria,High income,2014,57.3,21.392135
16,Austria,High income,2015,58.3,22.392135
17,Austria,High income,2016,60.0,24.092135
18,Austria,High income,2017,58.5,22.592135
19,Austria,High income,2018,58.3,22.392135
...,...,...,...,...,...
345,Turkey,Upper middle income,2014,7.3,-24.608750
346,Turkey,Upper middle income,2015,5.5,-26.408750
347,Turkey,Upper middle income,2016,5.2,-26.708750
348,Turkey,Upper middle income,2017,18.5,-13.408750
349,Turkey,Upper middle income,2018,21.9,-10.008750

In [36]:
concat_data.to_csv('diff_share_female_sole_pro.csv')